---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.Dispose
source: html/f73cd7db-0c07-84ea-9f54-0317045eb812.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.Dispose Method

Releases all resources used by the AnalysisDisplayColoredSurfaceSettings

## Syntax (C#)
```csharp
public void Dispose()
```